kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_RN4020_Set_CTS(int value)
{
#ifdef ENABLE_RN4020
    return (HAL_GPIO_WritePin(GPIOA,GPIO_PIN_2, value ? GPIO_PIN_SET : GPIO_PIN_RESET );
#endif
}

void HAL_RN4020_Set_CMD_MLDP(int value)
{
#ifdef ENABLE_RN4020
    return (HAL_GPIO_WritePin(GPIOC,GPIO_PIN_2, value ? GPIO_PIN_SET : GPIO_PIN_RESET );
#endif
}

void HAL_SPI_Comm_Ready_Assert() /* Active:  Low */
{
#ifdef ENABLE_SPI_COMM_READY_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_SPI_Comm_Ready_GPIO_Port, NAVX_2_RPI_SPI_Comm_Ready_Pin, GPIO_PIN_RESET);
#endif
}

void HAL_SPI_Comm_Ready_Deassert()
{
#ifdef ENABLE_SPI_COMM_READY_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_SPI_Comm_Ready_GPIO_Port, NAVX_2_RPI_SPI_Comm_Ready_Pin, GPIO_PIN_SET);
#endif
}

void HAL_CAN_Int_Assert()
{
#ifdef CAN_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_INT3_GPIO_Port, NAVX_2_RPI_INT3_Pin, GPIO_PIN_RESET);
#endif
}

void HAL_CAN_Int_Deassert()
{
#ifdef CAN_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_INT3_GPIO_Port, NAVX_2_RPI_INT3_Pin, GPIO_PIN_SET);
#endif
}

void HAL_AHRS_Int_Assert()
{
#ifdef AHRS_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_INT2_GPIO_Port, NAVX_2_RPI_INT2_Pin, GPIO_PIN_RESET);
#endif
}

void HAL_AHRS_Int_Deassert()
{
#ifdef AHRS_INTERRUPT
	  HAL_GPIO_WritePin(NAVX_2_RPI_INT2_GPIO_Port, NAVX_2_RPI_INT2_Pin, GPIO_PIN_SET);
#endif
}

void HAL_CAN_Status_LED_On(int on)
{
#ifdef ENABLE_CAN_TRANSCEIVER
	HAL_GPIO_WritePin( CAN_OK_LED_GPIO_Port, CAN_OK_LED_Pin, on ? GPIO_PIN_SET : GPIO_PIN_RESET);
#endif
}

void HAL_RTC_InitializeCache()
{
#ifdef ENABLE_RTC
	RTC_TimeTypeDef sTime;
	HAL_RTC_GetTime(&hrtc, &sTime, FORMAT_BIN);
	switch (sTime.DayLightSaving)
	{
	case RTC_DAYLIGHTSAVING_SUB1H:
		s_daylight_savings = 2;
		break;
	case RTC_DAYLIGHTSAVING_ADD1H:
		s_daylight_savings = 1;
		break;
	default:
		s_daylight_savings = 0;
		break;
	}
#endif
}

void HAL_RTC_Get_DaylightSavings(uint8_t *daylight_savings)
{
#ifdef ENABLE_RTC
	*daylight_savings = s_daylight_savings;
#endif
}

void HAL_RTC_Set_DaylightSavings(uint8_t daylight_savings)
{
#ifdef ENABLE_RTC
	/* NOTE:  This will take effect the next time SetTime() occurs. */
	s_daylight_savings = daylight_savings;
#endif
}


void HAL_RTC_Get_Time(uint8_t *hours, uint8_t *minutes, uint8_t *seconds, uint32_t *subseconds)
{
#ifdef ENABLE_RTC
	RTC_TimeTypeDef sTime;
	HAL_RTC_GetTime(&hrtc, &sTime, FORMAT_BIN);
	*hours = sTime.Hours;
	*minutes = sTime.Minutes;
	*seconds = sTime.Seconds;
	*subseconds = sTime.SubSeconds;
#endif
}

void HAL_RTC_Set_Time(uint8_t hours, uint8_t minutes, uint8_t seconds)
{
#ifdef ENABLE_RTC
	RTC_TimeTypeDef sTime;
	switch (s_daylight_savings)
	{
	case 2:
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_SUB1H;
		break;
	case 1:
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_ADD1H;
		break;
	default:
		sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
		break;
	}
	sTime.TimeFormat = 0;
	sTime.StoreOperation = RTC_STOREOPERATION_SET;
	sTime.Hours = hours;
	sTime.Minutes = minutes;
	sTime.Seconds = seconds;
	HAL_RTC_SetTime(&hrtc, &sTime, FORMAT_BIN);
#endif
}

void HAL_RTC_Set_Date(uint8_t day, uint8_t date, uint8_t month, uint8_t year)
{
#ifdef ENABLE_RTC
	RTC_DateTypeDef sDate;
	sDate.WeekDay = day;
	sDate.Date = date;
	sDate.Month = month;
	sDate.Year = year;
	HAL_RTC_SetDate(&hrtc, &sDate, FORMAT_BIN);
#endif
}


void HAL_RTC_Get_Date(uint8_t *weekday, uint8_t *date, uint8_t *month, uint8_t *year)
{
#ifdef ENABLE_RTC
	RTC_DateTypeDef sDate;
	HAL_RTC_GetDate(&hrtc, &sDate, FORMAT_BIN);
	*weekday = sDate.WeekDay;
	*date = sDate.Date;
	*month = sDate.Month;
	*year = sDate.Year;
#endif
}

#ifdef ENABLE_IOCX

typedef enum  {
	INT_EXTI,	/* STM32 External Interrupt Line */
	INT_SWED,	/* Software Edge Detection */
	INT_ALTPIN, /* This GPIO also connected to a secondary INT input pin. */
	INT_NONE
} GPIO_INTERRUPT_TYPE;

typedef struct {
	GPIO_TypeDef *p_gpio;
	uint16_t pin;
	uint8_t timer_index;
	GPIO_INTERRUPT_TYPE interrupt_type;
	uint8_t interrupt_index;
	uint8_t alt_function;
} GPIO_Channel;

#define MAX_VALID_STM32_AF_VALUE 0x0F
#define GPIO_AF_SW_RESET_COUNTER (MAX_VALID_STM32_AF_VALUE + 1)

static GPIO_Channel gpio_channels[IOCX_NUM_GPIOS] =
{
	{PWM_GPIO1_GPIO_Port, 	PWM_GPIO1_Pin, 	4,  INT_EXTI, 0,  GPIO_AF2_TIM5},
	{PWM_GPIO2_GPIO_Port, 	PWM_GPIO2_Pin, 	4,  INT_EXTI, 1,  GPIO_AF2_TIM5},
	{PWM_GPIO3_GPIO_Port, 	PWM_GPIO3_Pin, 	5,  INT_EXTI, 2,  GPIO_AF3_TIM9},
	{PWM_GPIO4_GPIO_Port, 	PWM_GPIO4_Pin, 	5,  INT_EXTI, 3,  GPIO_AF3_TIM9},
	{QE1_A_GPIO_Port, 		QE1_A_Pin, 		0,  INT_EXTI, 4,  GPIO_AF1_TIM1},
	{QE1_B_GPIO_Port, 		QE1_B_Pin, 		0,  INT_EXTI, 5,  GPIO_AF1_TIM1},
	{QE2_A_GPIO_Port, 		QE2_A_Pin, 		1,  INT_EXTI, 6,  GPIO_AF1_TIM2},
	{QE2_B_GPIO_Port, 		QE2_B_Pin, 		1,  INT_SWED, 7,  GPIO_AF1_TIM2},
	{QE3_A_GPIO_Port, 		QE3_A_Pin, 		2,  INT_SWED, 8,  GPIO_AF2_TIM3},
	{QE3_B_GPIO_Port, 		QE3_B_Pin, 		2,  INT_EXTI, 9,  GPIO_AF2_TIM3},
	{QE4_A_GPIO_Port, 		QE4_A_Pin, 		3,  INT_EXTI, 10, GPIO_AF2_TIM4},
	{QE4_B_GPIO_Port, 		QE4_B_Pin, 		3,  INT_EXTI, 11, GPIO_AF2_TIM4},
};

static uint8_t IOCX_gpio_pin_to_interrupt_index_map[IOCX_NUM_INTERRUPTS];
static uint8_t IOCX_gpio_pin_to_gpio_channel_index_map[IOCX_NUM_INTERRUPTS];
static uint32_t IOCX_gpio_pin_mode_configuration[IOCX_NUM_INTERRUPTS];
static volatile uint16_t int_status = 0;  /* Todo:  Review Race Conditions */
static volatile uint16_t last_int_edge = 0;
static volatile uint16_t int_mask = 0; /* Todo:  Review Race Conditions */

static void HAL_IOCX_EXTI_ISR(uint8_t gpio_pin)
{
	if (gpio_pin < IOCX_NUM_INTERRUPTS) {
		uint8_t gpio_interrupt_index = IOCX_gpio_pin_to_interrupt_index_map[gpio_pin];
		uint8_t gpio_channel_index = IOCX_gpio_pin_to_gpio_channel_index_map[gpio_pin];
		uint16_t interrupt_bit = (1 << gpio_interrupt_index);
		if (HAL_GPIO_ReadPin(gpio_channels[gpio_channel_index].p_gpio, gpio_channels[gpio_channel_index].pin) == GPIO_PIN_SET) {
			last_int_edge |= interrupt_bit;
		} else {
			last_int_edge &= ~interrupt_bit;
		}

		HAL_IOCX_AssertInterrupt(interrupt_bit);
	}
}

void HAL_IOCX_Init()
{
	uint8_t i;
	for (i = 0; i < IOCX_NUM_GPIOS; i++) {
		if (gpio_channels[i].interrupt_type == INT_EXTI) {
			IOCX_gpio_pin_to_interrupt_index_map[POSITION_VAL(gpio_channels[i].pin)] = gpio_channels[i].interrupt_index;
			IOCX_gpio_pin_to_gpio_channel_index_map[POSITION_VAL(gpio_channels[i].pin)] = i;
			IOCX_gpio_pin_mode_configuration[POSITION_VAL(gpio_channels[i].pin)] = 0;
			attachInterrupt(gpio_channels[i].pin, &HAL_IOCX_EXTI_ISR, FALLING);
		}
	}
}

