kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
	uint8_t num_samples_to_accumulate = 1 << oversample_bits;

	/* Determine which contiguous region of the ADC DMA transfer buffer     */
	/* contains the most recent N samples, where N is defined by the number */
	/* of oversample bits.                                                  */

	/* Note each transfer is a 16-bit ADC Sample (2 bytes) */
	uint32_t remaining_adc_transfers = hadc1.DMA_Handle->Instance->NDTR;
	uint32_t last_valid_adc_transfer = c_total_adc_transfers - remaining_adc_transfers;
	uint32_t total_adc_transfer_sets = sizeof(adc_samples) / c_num_adc_transfers_per_sampleset;

	uint16_t last_valid_adc_transfer_set = last_valid_adc_transfer / c_num_adc_transfers_per_sampleset;
	uint16_t first_valid_adc_transfer_set;
	if (num_samples_to_accumulate <= last_valid_adc_transfer_set) {
		first_valid_adc_transfer_set = last_valid_adc_transfer_set - num_samples_to_accumulate;
	} else {
		first_valid_adc_transfer_set = total_adc_transfer_sets - num_samples_to_accumulate;
	}

	/* Zero Accumulator */
	int i, j;
	for ( i = 0; i < n_channels; i++ ) {
		p_oversamples[i] = 0;
	}
	/* Accumulate */
	for ( i = first_valid_adc_transfer_set; i <= last_valid_adc_transfer_set; i++ ) {
		uint16_t *p_sample_set = &(adc_samples[i].data[start_channel]);
		for ( j = 0; j < n_channels; j++ ) {
			p_oversamples[j] += *p_sample_set++;
		}
	}
	/* Average */
	for ( i = 0; i < n_channels; i++ ) {
		p_avgsamples[i] = p_oversamples[i] >> avg_bits;
	}
#endif
}

void HAL_IOCX_ADC_Get_Samples( int start_channel, int n_channels, uint16_t* p_samples, uint8_t n_samples_to_average )
{
#ifdef ENABLE_ADC
	/* Range-check inputs */
	if ( n_samples_to_average > (sizeof(adc_samples)/sizeof(adc_samples[0]))) {
		n_samples_to_average = (sizeof(adc_samples)/sizeof(adc_samples[0]));
	}
	if (start_channel > (ADC_NUM_CHANNELS-1)) {
		return;
	}
	if ((start_channel + n_channels) > (ADC_NUM_CHANNELS-1)) {
		n_channels = ADC_NUM_CHANNELS - start_channel;
	}
	if (n_samples_to_average > MAX_NUM_ADC_SAMPLES ) {
		n_samples_to_average = MAX_NUM_ADC_SAMPLES;
	}
	/* Zero Accumulator */
	uint32_t accum[ADC_NUM_CHANNELS];
	int i, j;
	for ( i = 0; i < ADC_NUM_CHANNELS; i++ ) {
		accum[i] = 0;
	}
	/* Accumulate */
	for ( i = 0; i < n_samples_to_average; i++ ) {
		uint16_t *p_samples = &(adc_samples[i].data[start_channel]);
		for ( j = 0; j < n_channels; j++ ) {
			accum[j] += *p_samples++;
		}
	}
	/* Average */
	for ( i = 0; i < n_channels; i++ ) {
		p_samples[i] = accum[i] / n_samples_to_average;
	}
#endif
}

#define ADC_VOLTAGE_OVERSAMPLE_BITS 3
#define ADC_VOLTAGE_AVERAGE_BITS ADC_VOLTAGE_OVERSAMPLE_BITS
/* Returns 0 if 3.3V, non-zero of 5V VDA */
int HAL_IOCX_ADC_Voltage_5V( int n_samples_to_average )
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint32_t oversample;
		uint32_t average;
		HAL_IOCX_ADC_Get_Latest_Samples(ADC_CHANNEL_ANALOG_VOLTAGE_SWITCH, 1, &oversample, ADC_VOLTAGE_OVERSAMPLE_BITS,
				&average, ADC_VOLTAGE_AVERAGE_BITS);
		return (average > 3500) ? 1 : 0;
	} else {
		return 0;
	}
#else
    return 0;
#endif
}

#define ADC_EXT_POWER_OVERSAMPLE_BITS 3
#define ADC_EXT_POWER_AVERAGE_BITS ADC_EXT_POWER_OVERSAMPLE_BITS
const float vdiv_ratio = 3.24f / (11.5f + 3.24f);

uint16_t HAL_IOCX_Get_ExtPower_Voltage()
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint32_t oversample;
		uint32_t average;
		HAL_IOCX_ADC_Get_Latest_Samples(ADC_CHANNEL_EXT_POWER_VOLTAGE_DIV, 1, &oversample,
				ADC_EXT_POWER_OVERSAMPLE_BITS, &average, ADC_EXT_POWER_AVERAGE_BITS);
		return average;
	} else {
		return 0;
	}
#else
    return 0;
#endif
}

#ifdef ENABLE_ADC
static int awdg_enabled = 0;
uint8_t awdg_channel = INVALID_ADC_CHANNEL_NUMBER;
uint16_t awdg_low_threshold = 0;
uint16_t awdg_high_threshold = 0;
int awdg_interrupt_enabled = 0;
#endif

void HAL_IOCX_ADC_AWDG_Disable()
{
#ifdef ENABLE_ADC
	ADC_AnalogWDGConfTypeDef AnalogWDGConfig;

	/**Configure the analog watchdog
	*/
	AnalogWDGConfig.WatchdogMode = ADC_ANALOGWATCHDOG_NONE;
	if(HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) == HAL_OK) {
		awdg_enabled = 0;
		awdg_channel = INVALID_ADC_CHANNEL_NUMBER;
	}

#endif
}

void HAL_IOCX_ADC_AWDG_Enable(uint8_t channel)
{
#ifdef ENABLE_ADC
	if ( channel < ADC_NUM_EXTERNAL_CHANNELS ) {
		ADC_AnalogWDGConfTypeDef AnalogWDGConfig;

		/**Configure the analog watchdog
		*/
		AnalogWDGConfig.WatchdogMode = ADC_ANALOGWATCHDOG_SINGLE_REG;
		AnalogWDGConfig.HighThreshold = awdg_high_threshold;
		AnalogWDGConfig.LowThreshold = awdg_low_threshold;
		AnalogWDGConfig.Channel = adc_channels[channel];
		AnalogWDGConfig.ITMode = awdg_interrupt_enabled ? ENABLE : DISABLE;
		if(HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) == HAL_OK) {
			awdg_enabled = !0;
			awdg_channel = channel;
		}
	}
#endif
}

/* Returns non-zero if enabled */
int HAL_IOCX_ADC_AWDG_Is_Enabled(uint8_t* p_channel)
{
#ifdef ENABLE_ADC
	return awdg_enabled;
#else
	return 0;
#endif
}

uint16_t HAL_IOCX_ADC_AWDG_Get_Threshold_High()
{
#ifdef ENABLE_ADC
	return awdg_high_threshold;
#else
	return 0;
#endif
}

uint16_t HAL_IOCX_ADC_AWDG_Get_Threshold_Low()
{
#ifdef ENABLE_ADC
	return awdg_low_threshold;
#else
	return 0;
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Threshold_High(uint16_t threshold)
{
#ifdef ENABLE_ADC
	awdg_high_threshold = threshold;
	if(awdg_enabled) {
		hadc1.Instance->HTR = threshold;
	}
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Threshold_Low(uint16_t threshold)
{
#ifdef ENABLE_ADC
	awdg_low_threshold = threshold;
	if(awdg_enabled) {
		hadc1.Instance->LTR = threshold;
	}
#endif
}

int HAL_IOCX_ADC_AWDG_Get_Interrupt_Enable()
{
#ifdef ENABLE_ADC
	return awdg_interrupt_enabled;
#else
	return 0;
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Interrupt_Enable(int enable)
{
#ifdef ENABLE_ADC
	awdg_interrupt_enabled = enable;
	if(awdg_enabled) {
	/* Enable the ADC Analog watchdog interrupt */
		__HAL_ADC_ENABLE_IT(&hadc1, ADC_IT_AWD);
	} else {
	/* Disable the ADC Analog watchdog interrupt */
		__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD);
	}
#endif
}

